package hw1;

public class Task4 {

    // Найти сумму цифр 2х значного числа
    //Например,
    //для числа 45 сумма цифр равна 9
    //для числа 11 сумма цифр равна 2

    public static void main(String[] args) {
        int number = 11;
        System.out.println(number/10 + number%10);
    }
}
