package hw3;

public class Task1 {

    public static void main(String[] args) {
        // Задачи на FOR
        //Вывести на экран первые 10 элементов последовательности 2 4 6 8 10 и тд
        int a = 0;

        for (int i = 0; i < 10; i++) {
            a += 2;
            System.out.println(a);
        }
    }
}
