package ru.itmo.homeworks.hw1;

public class Task1 {

    // Даны длина, ширина прямоугольника. Найти и вывести в консоль его площадь.
    public static void main(String[] args) {

        int length = 10, widht = 20;
        System.out.println(length * widht);
    }
}
